# Friction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..Friction Property
MEPSection Class See Also
---
The friction of the section.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Friction { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Friction As Double
	Get
```

Visual C++
---
```text
public:
property double Friction {
	double get ();
}
```

# Remarks
In one section, all section members have same friction. Default unit is Feet of Water (60 °F) per 100 feet. For Duct, unit type is UT_HVAC_Friction. For Pipe, unit type is UT_Piping_Friction
# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace